<!DOCTYPE html>
<html lang="zh-CN">
    <!-- title -->
<!-- keywords -->
<head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no">
    <meta name="author" content="Jack">
    <meta name="renderer" content="webkit">
    <meta name="copyright" content="Jack">
        <meta name="keywords" content="hexo,hexo-theme,hexo-blog">
    <meta name="description" content="小杰的技术博客">
    <meta name="description" content="概述：cpp很多时候被认为是c的超集，因为它对c做出了妥协然后进行了面向对象的实现。在cpp中，类可以使用struct或者class进行声明，虽然表现不同，但都是面向对象概念。面向对象的重要特性主要是封装、继承和多态。这里主要是对cpp面向对象特性的一个归纳总结。">
<meta property="og:type" content="article">
<meta property="og:title" content="cpp一些类概念">
<meta property="og:url" content="https://jack-samu.github.io/2023/06/06/cpp%E4%B8%80%E4%BA%9B%E7%B1%BB%E6%A6%82%E5%BF%B5/index.html">
<meta property="og:site_name" content="Jack &#39;s Studio">
<meta property="og:description" content="概述：cpp很多时候被认为是c的超集，因为它对c做出了妥协然后进行了面向对象的实现。在cpp中，类可以使用struct或者class进行声明，虽然表现不同，但都是面向对象概念。面向对象的重要特性主要是封装、继承和多态。这里主要是对cpp面向对象特性的一个归纳总结。">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="https://jack-samu.github.io/images/%E5%AF%B9%E8%B1%A1%E5%A3%B0%E6%98%8E%E5%89%8D.png">
<meta property="og:image" content="https://jack-samu.github.io/images/%E6%88%90%E5%91%98%E5%A3%B0%E6%98%8E%E5%90%8E.png">

<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">Base</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="type">int</span> a;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">int</span> <span class="title">back</span><span class="params">()</span></span>&#123;<span class="keyword">return</span> a;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived_A</span> :<span class="keyword">public</span> Base &#123;</span><br><span class="line">	<span class="type">int</span> b;</span><br><span class="line">	<span class="function"><span class="type">int</span> <span class="title">back</span><span class="params">()</span></span>&#123;<span class="keyword">return</span> b;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived_B</span> :<span class="keyword">public</span> Base &#123;</span><br><span class="line">	<span class="type">int</span> b;</span><br><span class="line">	<span class="function"><span class="type">int</span> <span class="title">back</span><span class="params">()</span></span>&#123;<span class="keyword">return</span> b;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>如上进行，两个派生类在基类的基础上进行继承并重写了虚函数，下面使用clang也就是llvm编译器来进行结构展示，执行命令<code>clang -Xclang -fdump-record-layouts -c test.cpp &gt; layout</code>查看内存布局：</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Base</span><br><span class="line">         0 |   (Base vftable pointer)</span><br><span class="line">         8 |   int a</span><br><span class="line">           | [sizeof=16, align=8,</span><br><span class="line">           |  nvsize=16, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived_A</span><br><span class="line">         0 |   class Base (primary base)</span><br><span class="line">         0 |     (Base vftable pointer)</span><br><span class="line">         8 |     int a</span><br><span class="line">        16 |   int b</span><br><span class="line">           | [sizeof=24, align=8,</span><br><span class="line">           |  nvsize=24, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived_B</span><br><span class="line">         0 |   class Base (primary base)</span><br><span class="line">         0 |     (Base vftable pointer)</span><br><span class="line">         8 |     int a</span><br><span class="line">        16 |   int b</span><br><span class="line">           | [sizeof=24, align=8,</span><br><span class="line">           |  nvsize=24, nvalign=8]</span><br></pre></td></tr></table></figure>
<p>执行命令<code>clang -Xclang -fdump-vtable-layouts -c test.cpp &gt; layout</code>查看虚表布局：</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line">VFTable for &#x27;Base&#x27; (2 entries).</span><br><span class="line">   0 | Base RTTI</span><br><span class="line">   1 | int Base::back()</span><br><span class="line"></span><br><span class="line">VFTable indices for &#x27;Base&#x27; (1 entry).</span><br><span class="line">   0 | int Base::back()</span><br><span class="line"></span><br><span class="line">VFTable for &#x27;Base&#x27; in &#x27;Derived_A&#x27; (2 entries).</span><br><span class="line">   0 | Derived_A RTTI</span><br><span class="line">   1 | int Derived_A::back()</span><br><span class="line"></span><br><span class="line">VFTable indices for &#x27;Derived_A&#x27; (1 entry).</span><br><span class="line">   0 | int Derived_A::back()</span><br><span class="line"></span><br><span class="line">VFTable for &#x27;Base&#x27; in &#x27;Derived_B&#x27; (2 entries).</span><br><span class="line">   0 | Derived_B RTTI</span><br><span class="line">   1 | int Derived_B::back()</span><br><span class="line"></span><br><span class="line">VFTable indices for &#x27;Derived_B&#x27; (1 entry).</span><br><span class="line">   0 | int Derived_B::back()</span><br></pre></td></tr></table></figure>
<p>如上，简单关注vftable信息即可，一个虚表包含RTTI指针和后面的类里面所有的虚函数，每一个虚函数表对应一个虚函数。当派生类没有对基类虚函数进行重写的时候，虚函数表中指向的是基类的虚函数，只有进行了重写才会把派生类虚表的对应地址进行覆盖。</p>
<p><strong>抽象基类</strong></p>
<p>在面向对象中，强大的继承机制，造就了一个又一个的庞大“家族”，它们之间，相互继承，相互嵌套，衍生出功能更多，体型更为庞大的派生类。在这种机制中，会有非常独特的基类存在，它的存在，只是为了继承，它并不想要别人声明这样的对象，这种基类就是抽象基类。</p>
<p>如何实现抽象基类？在这个基类内部声明一个纯虚函数就行，或者继承一个带有纯虚函数的类但并不对它进行重写覆盖。虚函数是使用virtual进行标识的成员函数，那么什么是纯虚函数？纯虚函数就是正常虚函数给后面添加=0标识即可。一般来说，纯虚函数和这个类都是不准备拿来用的，所以一般情况下，纯虚函数也不会进行定义，但要提供定义也可以，必须在类外部进行定义。</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">Base</span> &#123;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>= <span class="number">0</span>;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">void</span> <span class="title">Base::f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">	std::cout &lt;&lt; <span class="string">&quot;Nothing&quot;</span> &lt;&lt; std::endl;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>大概就上面的样式，对于这种只是拿来继承的基类，它的最大价值就是虚函数了，通过声明这么一个抽象基类的指针，然后指向派生类成员，派生类成员都可以对抽象基类的虚函数进行重写覆盖，然后这个指针调用该函数，它本来指向的对象是什么派生类，所调用虚函数就表现什么特性。</p>
<h4 id="菱形继承问题">2.3.1 菱形继承问题</h4>
<p>在继承中，一个基类可以衍生出许多派生类，派生类之间也可以相互继承派生，菱形继承就是两个拥有同样的基类的派生类，共同派生出一个派生类，这种就是菱形继承，那么它有什么问题？</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">Base</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="type">int</span> a;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived_A</span> :Base &#123;&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived_B</span> :Base &#123;&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived_C</span> : Derived_A , Derived_B &#123;&#125;;</span><br><span class="line"></span><br><span class="line">Derived_C c;</span><br><span class="line"><span class="comment">// 问题所在</span></span><br><span class="line">c.a = <span class="number">10</span>;</span><br></pre></td></tr></table></figure>
<p>当上面的代码进行编译的时候，问题就出现了：</p>
<figure class="highlight shell"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">PS D:\Desktop\test&gt; g++ test.cpp -o test</span><br><span class="line">test.cpp: In function &#x27;int main()&#x27;:</span><br><span class="line">test.cpp:17:4: error: request for member &#x27;a&#x27; is ambiguous</span><br><span class="line">  c.a = 10;</span><br><span class="line">    ^</span><br><span class="line">test.cpp:5:6: note: candidates are: &#x27;int Base::a&#x27;</span><br><span class="line">  int a;</span><br><span class="line">      ^</span><br><span class="line">test.cpp:5:6: note:                 &#x27;int Base::a&#x27;</span><br><span class="line">PS D:\Desktop\test&gt;</span><br></pre></td></tr></table></figure>
<p>ambiguous，模糊两可，表示a的出处并不明了，为何？因为上面的继承，会在两个派生类中都保留一份基类的a成员，这样的两个派生类再派生出的Derived_C派生类，它就有着两份基类信息：</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Base</span><br><span class="line">         0 |   int a</span><br><span class="line">           | [sizeof=4, align=4,</span><br><span class="line">           |  nvsize=4, nvalign=4]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived_A</span><br><span class="line">         0 |   class Base (base)</span><br><span class="line">         0 |     int a</span><br><span class="line">           | [sizeof=4, align=4,</span><br><span class="line">           |  nvsize=4, nvalign=4]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived_B</span><br><span class="line">         0 |   class Base (base)</span><br><span class="line">         0 |     int a</span><br><span class="line">           | [sizeof=4, align=4,</span><br><span class="line">           |  nvsize=4, nvalign=4]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived_C</span><br><span class="line">         0 |   class Derived_A (base)</span><br><span class="line">         0 |     class Base (base)</span><br><span class="line">         0 |       int a</span><br><span class="line">         4 |   class Derived_B (base)</span><br><span class="line">         4 |     class Base (base)</span><br><span class="line">         4 |       int a</span><br><span class="line">           | [sizeof=8, align=4,</span><br><span class="line">           |  nvsize=8, nvalign=4]</span><br></pre></td></tr></table></figure>
<p>如上，Derived_C的内存布局中，很明显的看出有着来自两个派生类中的Base的成员，所以调用的时候就出现了ambiguous两义性。针对这种方案的解决办法就是使用虚继承：</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">Base</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="type">int</span> a;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived_A</span> :<span class="keyword">virtual</span> <span class="keyword">public</span> Base &#123;&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived_B</span> :<span class="keyword">virtual</span> <span class="keyword">public</span> Base &#123;&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived_C</span> : <span class="keyword">public</span> Derived_A ,<span class="keyword">public</span> Derived_B &#123;&#125;;</span><br><span class="line"></span><br><span class="line">Derived_C c;</span><br><span class="line">c.a = <span class="number">10</span>;</span><br></pre></td></tr></table></figure>
<p>这时候编译就没问题了，运行ok。那么为什么给两个直接派生类修改继承方式为虚继承能解决问题呢？再来关注一下其布局：</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Base</span><br><span class="line">         0 |   int a</span><br><span class="line">           | [sizeof=4, align=4,</span><br><span class="line">           |  nvsize=4, nvalign=4]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived_A</span><br><span class="line">         0 |   (Derived_A vbtable pointer)</span><br><span class="line">         8 |   class Base (virtual base)</span><br><span class="line">         8 |     int a</span><br><span class="line">           | [sizeof=16, align=8,</span><br><span class="line">           |  nvsize=8, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived_B</span><br><span class="line">         0 |   (Derived_B vbtable pointer)</span><br><span class="line">         8 |   class Base (virtual base)</span><br><span class="line">         8 |     int a</span><br><span class="line">           | [sizeof=16, align=8,</span><br><span class="line">           |  nvsize=8, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived_C</span><br><span class="line">         0 |   class Derived_A (base)</span><br><span class="line">         0 |     (Derived_A vbtable pointer)</span><br><span class="line">         8 |   class Derived_B (base)</span><br><span class="line">         8 |     (Derived_B vbtable pointer)</span><br><span class="line">        16 |   class Base (virtual base)</span><br><span class="line">        16 |     int a</span><br><span class="line">           | [sizeof=24, align=8,</span><br><span class="line">           |  nvsize=16, nvalign=8]</span><br></pre></td></tr></table></figure>
<p>可以看到，Derived_A和Derived_B对Base进行了虚继承以后，开辟了一个指针内存，专门指向基类，所以最后的派生类Derived_C继承了两个基类，也继承了两份基类的虚指针，这样最后得到的其实是一份基类，所以也就没有了二义性。</p>
<h2 id="三一些面试问题">三、一些面试问题</h2>
<p><strong>构造函数可以是虚函数吗？为什么？</strong>，针对一个虚函数，只需要部分信息，就可以进行调用，也就是函数接口而不是具体类型，而构建一个对象，则需要具体的类型信息，构造函数做的就是这个工作，所以不能。</p>
<p><strong>析构函数为什么可以是虚函数</strong>，使用两个例子进行说明：</p>
